<template>
  <main>
    <Title text="Летняя школа программирования" />
    <QA_container :qa_list="qa_list_small"/>
    <QA_container :qa_list="qa_list_large"/>
  </main>
</template>

<script lang="ts">
import {defineComponent} from 'vue';
import Title from '@/components/Title.vue';
import QA_container from '@/components/QA_container.vue';

export default defineComponent({
  name: "SummerCamp",
  components: {Title, QA_container},
  data() {
    return {
      qa_list_small: [
        {q: "Что нужно, чтобы поехать?", a: "Нужно учиться в 54 школе и показать высокий результат на <RouterLink to=\"/olymp\">внутренней олимпиаде</RouterLink> или на региональном этапе ВсОШ."},
        {q: "Где и когда проходит лагерь?", a: "Лагерь проходит в Красновидово, в <a href=\"http://krasnovydovo.msu.ru/\" target=\"_blank\">доме отдыха МГУ</a> в середине августа. Лагерь длится примерно две недели."},
        {q: "Что еще есть в ЛШП, кроме уроков?", a: "В ЛШП проводятся спортивные мероприятия, командная олимпиада и даже контест, где часть команды ищет условия на территории базы, а другая их решает!"}
      ],
      qa_list_large: [
        {q: "Какой уровень тем?", a: "Уровень тем зависит от участников. В этом году были выделены 2 группы. В более сильной группе проходили корневую декомпозицию, СНМ, ДП по подотрезкам, поддеевьям, подмножествам, алгоритмы на графах (включая LCA, мосты, точки сочленения, КСС), алгоритмы на строках (включая префикс- и Z-функцию, бор, хеши), структуры для запросов по подотрезкам (ДО, лес Фенвика, sparse table). В более слабой&nbsp;&#0151; линейные алгоритмы (2 указателя, префиксные суммы), стек, очередь, дек, графы (DFS, BFS, Форд-Беллман, Флойд-Уоршелл, Дейкстра), битовые операции, STL, бинарный и тернарный поиски, линейное и двумерное ДП."}
      ]
    }
  }
})
</script>